%% @file    empdb_biz_event.erl
%%          Описание бизнес логики работы с фотографиями.
%%          Фотография это просто документ.
%% 
-module(empdb_biz_firecounts).

%% ===========================================================================
%% Заголовочные файлы
%% ===========================================================================

%%
%% Структры для работы с запросами к базе данных
%%
-include("empdb.hrl").


%% ==========================================================================
%% Экспортируемые функции
%% ==========================================================================

%%
%% Блоги
%%
-export([
    get/1
]).


get(Params)->
    empdb_dao:with_connection(fun(Con)->
        {ok, [{[
            {event, [{[empdb_dao_event:count(Con, [{isdeleted, false}|Params])]}] },
            {exile, [{[empdb_dao_exile:count(Con, [{isdeleted, false}|Params])]}]  }
        ]}]}
    end).


