%%%
%%% @file evman_gen_handler.erl
%%%     Абстрактный обработчик событий.
%%%     Можно переобределить его методы с помощью.
%%%
%%%         -behaviour(gen_event).
%%%         -extends(evman_gen_handler).
%%%

-module(evman_handler_echo).
-behaviour(gen_event).

%%%
%%% Используем наследование модулей,
%%% чтобы не тянуть кучу одинаковых методов.
%%% Если надо, мы всегда сможем из переопределить.
%%%
-extends(evman_handler).
-export([
    handle_event/2
]).

-define(HANDLERNAME, ?MODULE).


%%% ---------------------------------------------------------------------
%%%
%%% Отнаследованные методы
%%%
%%% ---------------------------------------------------------------------

%%%
%%% Для всего остального вызываем функции надмодуля.
%%%
handle_event(Some, State) ->
    ?BASE_MODULE:handle_event(Some, State).

