%%
%%
-module(empweb_biz_geo).

%% ==========================================================================
%% Экспортируемые функции
%% ==========================================================================
%%
%% Списки языков
%%
-export([
    update/1,
    create/1,
    get/1,
    get/2
]).


%% ==========================================================================
%% Внешние функции
%% ==========================================================================

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Списки языков
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

create(Params)->
    empdb_biz_geo:create(Params).

update(Params)->
    empdb_biz_geo:update(Params).

delete(Params)->
    empdb_biz_geo:delete(Params).

get(Params)->
    empdb_biz_geo:get(Params).

get(Params, Fields)->
    empdb_biz_geo:get(Params, Fields).
