%%
%%
-module(empweb_biz_cdocbet).

%% ==========================================================================
%% Экспортируемые функции
%% ==========================================================================

%%
%% Списки языков
%%
-export([
    update/1,
    create/1,
    get/1,
    get/2
]).


%% ==========================================================================
%% Внешние функции
%% ==========================================================================

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Списки языков
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

create(Params)->
    empdb_biz_cdocbet:create(Params).

update(Params)->
    empdb_biz_cdocbet:update(Params).

get(Params)->
    empdb_biz_cdocbet:get(Params).

get(Params, Fields)->
    empdb_biz_cdocbet:get(Params, Fields).
