%%
%%
-module(empweb_biz_cdoclot).

%% ==========================================================================
%% Экспортируемые функции
%% ==========================================================================

%%
%% Списки языков
%%
-export([
    update/1,
    create/1,
    get/1,
    get/2
]).


%% ==========================================================================
%% Внешние функции
%% ==========================================================================

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Списки языков
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

create(Params)->
    empdb_biz_cdoclot:create(Params).

update(Params)->
    empdb_biz_cdoclot:update(Params).

delete(Params)->
    empdb_biz_cdoclot:delete(Params).

get(Params)->
    empdb_biz_cdoclot:get(Params).

get(Params, Fields)->
    empdb_biz_cdoclot:get(Params, Fields).
