%%
%%
-module(empweb_biz_photo).

%% ==========================================================================
%% Экспортируемые функции
%% ==========================================================================

%%
%% Списки языков
%%
-export([
    update/1,
    create/1,
    delete/1,
    get/1,
    get/2
]).


%% ==========================================================================
%% Внешние функции
%% ==========================================================================

%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Списки языков
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

create(Params)->
    empdb_biz_photo:create(Params).

update(Params)->
    empdb_biz_photo:update(Params).

delete(Params)->
    empdb_biz_photo:delete(Params).

get(Params)->
    empdb_biz_photo:get(Params).

get(Params, Fields)->
    empdb_biz_photo:get(Params, Fields).
